# yolo12xx-cls-elite.yaml
nc: 100
scales:
  n:  [0.50, 0.25, 1024]
  s:  [0.50, 0.50, 1024]
  m:  [0.50, 1.00, 512]
  l:  [1.00, 1.00, 512]
  x:  [1.00, 1.50, 512]
  xx: [1.25, 2.00, 768]  # 自定义加大号 scale

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2]]       # 3-P3/8
  - [-1, 3, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]]       # 5-P4/16
  - [-1, 8, A2C2f, [512, True, 4]]    # ↑ 8 次
  - [-1, 1, Conv,  [1024, 3, 2]]      # 7-P5/32
  - [-1, 16, A2C2f,[1024, True, 1]]   # ↑ 16 次

head:
  - [-1, 1, FlowerHead, [nc]]  # 专为100类花卉分类任务定制的FlowerHead模块